24-mid-project/complex-load-test.yml
config:
  target: 'https://cat-cloud-401d19-staging.herokuapp.com'
  phases:
    - duration: 5 
      arrivalRate: 1 
    - duration: 10 # five seconds
      arrivalRate: 1000 # 20 fake users per second
  processor: './load-test-create-user.js'
scenarios:
  - name: "Create Users"
    flow:
    - function: 'create'
    - post:
        url: "/signup"
        json:
          username: "{{ username }}"
          email: "{{ email }}"
          password: "{{ password }}"
        capture:
          json: "$.token"
          as: "token"
    - log: "Sent a request to signup/"
    - post:
        url: "/profiles"
        headers:
          Authorization: "Bearer {{ token }}"
        json:
          bio: "{{ bio }}"
          avatar: "{{ avatar }}"
          firstName: "{{ firstName }}"
          lastName: "{{ lastName }}"
    - log : "Sent a request to profiles/"